experiment-data/k3s/dp_redis_density-3/dp_redis_density/2022-10-28T09-04-05/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          652.58          ---          ---        27.78292        22.78300       143.35900       239.61500        50.27 
Gets         6524.27         0.33      6523.94        27.80441        22.78300       143.35900       240.63900       254.14 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       7176.86         0.33      6523.94        27.80246        22.78300       143.35900       240.63900       304.41 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.207        0.000
SET       4.735        5.000
SET       8.383       10.000
SET      10.879       15.000
SET      12.991       20.000
SET      14.847       25.000
SET      16.383       30.000
SET      18.047       35.000
SET      19.583       40.000
SET      21.119       45.000
SET      22.783       50.000
SET      23.679       52.500
SET      24.447       55.000
SET      25.343       57.500
SET      26.367       60.000
SET      27.391       62.500
SET      28.415       65.000
SET      29.439       67.500
SET      30.719       70.000
SET      31.999       72.500
SET      33.535       75.000
SET      34.047       76.250
SET      34.815       77.500
SET      35.839       78.750
SET      36.607       80.000
SET      37.631       81.250
SET      38.655       82.500
SET      39.679       83.750
SET      40.959       85.000
SET      42.239       86.250
SET      44.031       87.500
SET      44.799       88.125
SET      45.823       88.750
SET      46.591       89.375
SET      47.871       90.000
SET      48.895       90.625
SET      50.175       91.250
SET      51.455       91.875
SET      53.247       92.500
SET      55.039       93.125
SET      57.087       93.750
SET      58.367       94.062
SET      59.647       94.375
SET      61.183       94.688
SET      62.975       95.000
SET      65.023       95.312
SET      67.071       95.625
SET      69.631       95.938
SET      72.191       96.250
SET      75.775       96.562
SET      80.383       96.875
SET      82.943       97.031
SET      86.015       97.188
SET      89.087       97.344
SET      92.671       97.500
SET      96.255       97.656
SET     100.351       97.812
SET     104.447       97.969
SET     108.543       98.125
SET     113.663       98.281
SET     119.295       98.438
SET     122.367       98.516
SET     125.439       98.594
SET     127.999       98.672
SET     132.095       98.750
SET     135.167       98.828
SET     139.263       98.906
SET     142.335       98.984
SET     146.431       99.062
SET     150.527       99.141
SET     155.647       99.219
SET     158.719       99.258
SET     160.767       99.297
SET     163.839       99.336
SET     165.887       99.375
SET     168.959       99.414
SET     172.031       99.453
SET     175.103       99.492
SET     179.199       99.531
SET     184.319       99.570
SET     188.415       99.609
SET     190.463       99.629
SET     192.511       99.648
SET     195.583       99.668
SET     197.631       99.688
SET     199.679       99.707
SET     202.751       99.727
SET     205.823       99.746
SET     208.895       99.766
SET     211.967       99.785
SET     216.063       99.805
SET     217.087       99.814
SET     219.135       99.824
SET     222.207       99.834
SET     224.255       99.844
SET     226.303       99.854
SET     228.351       99.863
SET     230.399       99.873
SET     233.471       99.883
SET     236.543       99.893
SET     240.639       99.902
SET     242.687       99.907
SET     244.735       99.912
SET     246.783       99.917
SET     248.831       99.922
SET     251.903       99.927
SET     253.951       99.932
SET     255.999       99.937
SET     260.095       99.941
SET     262.143       99.946
SET     266.239       99.951
SET     268.287       99.954
SET     270.335       99.956
SET     274.431       99.958
SET     274.431       99.961
SET     278.527       99.963
SET     280.575       99.966
SET     286.719       99.968
SET     290.815       99.971
SET     296.959       99.973
SET     301.055       99.976
SET     303.103       99.977
SET     305.151       99.978
SET     307.199       99.979
SET     309.247       99.980
SET     311.295       99.982
SET     315.391       99.983
SET     317.439       99.984
SET     317.439       99.985
SET     321.535       99.987
SET     323.583       99.988
SET     323.583       99.988
SET     325.631       99.989
SET     327.679       99.990
SET     331.775       99.990
SET     331.775       99.991
SET     333.823       99.991
SET     335.871       99.992
SET     337.919       99.993
SET     342.015       99.993
SET     342.015       99.994
SET     344.063       99.994
SET     344.063       99.995
SET     346.111       99.995
SET     346.111       99.995
SET     348.159       99.995
SET     350.207       99.996
SET     350.207       99.996
SET     350.207       99.996
SET     350.207       99.997
SET     354.303       99.997
SET     354.303       99.997
SET     356.351       99.997
SET     356.351       99.997
SET     358.399       99.998
SET     358.399       99.998
SET     358.399       99.998
[...]
SET     362.495       99.998
SET     362.495       99.998
SET     362.495       99.999
SET     362.495       99.999
SET     362.495       99.999
SET     364.543       99.999
SET     364.543       99.999
SET     364.543       99.999
SET     374.783       99.999
SET     374.783       99.999
SET     374.783       99.999
SET     378.879       99.999
SET     378.879       99.999
SET     378.879       99.999
[...]
SET     380.927      100.000
SET     380.927      100.000
SET     380.927      100.000
[...]
SET     405.503      100.000
SET     405.503      100.000
---
GET       0.199        0.000
GET       4.735        5.000
GET       8.383       10.000
GET      10.879       15.000
GET      13.055       20.000
GET      14.847       25.000
GET      16.511       30.000
GET      18.047       35.000
GET      19.583       40.000
GET      21.119       45.000
GET      22.783       50.000
GET      23.679       52.500
GET      24.447       55.000
GET      25.343       57.500
GET      26.367       60.000
GET      27.391       62.500
GET      28.415       65.000
GET      29.567       67.500
GET      30.719       70.000
GET      31.999       72.500
GET      33.535       75.000
GET      34.303       76.250
GET      35.071       77.500
GET      35.839       78.750
GET      36.607       80.000
GET      37.631       81.250
GET      38.655       82.500
GET      39.679       83.750
GET      40.959       85.000
GET      42.495       86.250
GET      44.031       87.500
GET      44.799       88.125
GET      45.823       88.750
GET      46.591       89.375
GET      47.871       90.000
GET      48.895       90.625
GET      50.175       91.250
GET      51.455       91.875
GET      53.247       92.500
GET      55.039       93.125
GET      57.087       93.750
GET      58.367       94.062
GET      59.647       94.375
GET      61.183       94.688
GET      62.975       95.000
GET      64.767       95.312
GET      67.071       95.625
GET      69.631       95.938
GET      72.703       96.250
GET      76.287       96.562
GET      80.383       96.875
GET      82.943       97.031
GET      86.015       97.188
GET      89.087       97.344
GET      92.671       97.500
GET      96.255       97.656
GET     100.351       97.812
GET     104.447       97.969
GET     109.055       98.125
GET     114.175       98.281
GET     119.295       98.438
GET     122.367       98.516
GET     125.439       98.594
GET     128.511       98.672
GET     132.095       98.750
GET     135.167       98.828
GET     138.239       98.906
GET     142.335       98.984
GET     146.431       99.062
GET     150.527       99.141
GET     155.647       99.219
GET     157.695       99.258
GET     160.767       99.297
GET     163.839       99.336
GET     165.887       99.375
GET     168.959       99.414
GET     173.055       99.453
GET     176.127       99.492
GET     180.223       99.531
GET     183.295       99.570
GET     188.415       99.609
GET     190.463       99.629
GET     192.511       99.648
GET     195.583       99.668
GET     197.631       99.688
GET     200.703       99.707
GET     203.775       99.727
GET     206.847       99.746
GET     208.895       99.766
GET     212.991       99.785
GET     217.087       99.805
GET     218.111       99.814
GET     220.159       99.824
GET     222.207       99.834
GET     224.255       99.844
GET     226.303       99.854
GET     229.375       99.863
GET     231.423       99.873
GET     234.495       99.883
GET     237.567       99.893
GET     241.663       99.902
GET     243.711       99.907
GET     244.735       99.912
GET     246.783       99.917
GET     248.831       99.922
GET     250.879       99.927
GET     253.951       99.932
GET     255.999       99.937
GET     259.071       99.941
GET     262.143       99.946
GET     266.239       99.951
GET     268.287       99.954
GET     270.335       99.956
GET     272.383       99.958
GET     274.431       99.961
GET     276.479       99.963
GET     278.527       99.966
GET     282.623       99.968
GET     284.671       99.971
GET     288.767       99.973
GET     292.863       99.976
GET     294.911       99.977
GET     296.959       99.978
GET     299.007       99.979
GET     301.055       99.980
GET     303.103       99.982
GET     305.151       99.983
GET     309.247       99.984
GET     311.295       99.985
GET     313.343       99.987
GET     317.439       99.988
GET     317.439       99.988
GET     319.487       99.989
GET     321.535       99.990
GET     321.535       99.990
GET     323.583       99.991
GET     325.631       99.991
GET     327.679       99.992
GET     327.679       99.993
GET     331.775       99.993
GET     333.823       99.994
GET     333.823       99.994
GET     335.871       99.995
GET     337.919       99.995
GET     339.967       99.995
GET     339.967       99.995
GET     342.015       99.996
GET     342.015       99.996
GET     344.063       99.996
GET     346.111       99.997
GET     346.111       99.997
GET     348.159       99.997
GET     348.159       99.997
GET     350.207       99.997
GET     350.207       99.998
GET     352.255       99.998
GET     354.303       99.998
GET     356.351       99.998
GET     358.399       99.998
GET     360.447       99.998
GET     360.447       99.998
GET     362.495       99.999
GET     362.495       99.999
GET     362.495       99.999
GET     364.543       99.999
GET     364.543       99.999
GET     366.591       99.999
GET     372.735       99.999
GET     376.831       99.999
GET     376.831       99.999
GET     376.831       99.999
[...]
GET     378.879       99.999
GET     378.879       99.999
GET     378.879       99.999
[...]
GET     378.879      100.000
GET     380.927      100.000
GET     380.927      100.000
GET     393.215      100.000
GET     393.215      100.000
GET     397.311      100.000
GET     397.311      100.000
GET     397.311      100.000
[...]
GET     399.359      100.000
GET     399.359      100.000
GET     399.359      100.000
GET     401.407      100.000
GET     401.407      100.000
GET     403.455      100.000
GET     403.455      100.000
GET     405.503      100.000
GET     405.503      100.000
GET     405.503      100.000
[...]
GET     411.647      100.000
GET     411.647      100.000
---
WAIT      0.000      100.000